In [1]:
import pandas as pd
import numpy as np 

#handling the missing values in dataset
a=np.array([2,5,3,6,np.nan,56,np.nan])
a.sum()

np.float64(nan)

In [2]:
df=pd.read_excel(r"C:\Users\ABHISHEK YADAV\Downloads\DATA12.xlsx")
df.shape
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth,Salary
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30,NaN
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23,NaN
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06,NaN
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04,NaN
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df.isnull().sum()

ID            1
Name          3
Industry      4
Inception     2
Revenue       4
Expenses      4
Profit        1
Growth        5
Salary       10
dtype: int64

In [4]:
df.drop(['Salary'],axis=1,inplace=True)
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
df.isnull().sum()/len(df)

ID           0.1
Name         0.3
Industry     0.4
Inception    0.2
Revenue      0.4
Expenses     0.4
Profit       0.1
Growth       0.5
dtype: float64

In [6]:
df.dropna(how='all',inplace=True)
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      float64
 1   Name       7 non-null      object
 2   Industry   6 non-null      object
 3   Inception  8 non-null      float64
 4   Revenue    6 non-null      object
 5   Expenses   6 non-null      object
 6   Profit     9 non-null      float64
 7   Growth     5 non-null      float64
dtypes: float64(4), object(4)
memory usage: 648.0+ bytes

In [8]:
s=df['Revenue']
s

0    $11,757,018
1    $12,329,371
2    $10,597,009
3             NaN
4             NaN
5             NaN
6     $9,254,614
7     $9,451,943
8    $14,001,180
Name: Revenue, dtype: object

In [9]:
df['Revenue']=df['Revenue'].fillna('0')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18

In [10]:
p=df['Revenue']
p

0    $11,757,018
1    $12,329,371
2    $10,597,009
3               0
4               0
5               0
6     $9,254,614
7     $9,451,943
8    $14,001,180
Name: Revenue, dtype: object

In [11]:
r=[]
for i in p:
    s=""
    for j in i:
        if(j.isdigit()):
            s=s+j
    r.append(s)
r

['11757018',
 '12329371',
 '10597009',
 '0',
 '0',
 '0',
 '9254614',
 '9451943',
 '14001180']

In [12]:
df['Revenue']=r
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,"6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,"916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,"3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,NaN,11901180.0,0.18

In [13]:
df['Revenue']=df['Revenue'].astype('int')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,"6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,"916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,"3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,NaN,11901180.0,0.18

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      float64
 1   Name       7 non-null      object
 2   Industry   6 non-null      object
 3   Inception  8 non-null      float64
 4   Revenue    9 non-null      int64
 5   Expenses   6 non-null      object
 6   Profit     9 non-null      float64
 7   Growth     5 non-null      float64
dtypes: float64(4), int64(1), object(3)
memory usage: 648.0+ bytes

In [15]:
s=df['Expenses']
s

0    6,482,465 Dollars
1      916,455 Dollars
2                  NaN
3    7,429,377 Dollars
4    7,435,363 Dollars
5    5,470,303 Dollars
6                  NaN
7    3,878,113 Dollars
8                  NaN
Name: Expenses, dtype: object

In [16]:
df['Expenses']=df['Expenses'].fillna('0')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,"6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,"916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,"3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,0,11901180.0,0.18

In [17]:
p=df['Expenses']
p

0    6,482,465 Dollars
1      916,455 Dollars
2                    0
3    7,429,377 Dollars
4    7,435,363 Dollars
5    5,470,303 Dollars
6                    0
7    3,878,113 Dollars
8                    0
Name: Expenses, dtype: object

In [18]:
r=[]
for i in p:
    s=""
    for j in i:
        if(j.isdigit()):
            s=s+j
    r.append(s)
r

['6482465',
 '916455',
 '0',
 '7429377',
 '7435363',
 '5470303',
 '0',
 '3878113',
 '0']

In [19]:
df['Expenses']=r
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,6482465,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,916455,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,7429377,6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,7435363,3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,5470303,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,3878113,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,0,11901180.0,0.18

In [20]:
df['Expenses']=df['Expenses'].astype('int')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018,6482465,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371,916455,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,0,7429377,6597557.0,NaN
4,5.0,NaN,NaN,NaN,0,7435363,3138627.0,NaN
5,6.0,Techline,Health,2006.0,0,5470303,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943,3878113,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180,0,11901180.0,0.18

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      float64
 1   Name       7 non-null      object
 2   Industry   6 non-null      object
 3   Inception  8 non-null      float64
 4   Revenue    9 non-null      int64
 5   Expenses   9 non-null      int64
 6   Profit     9 non-null      float64
 7   Growth     5 non-null      float64
dtypes: float64(4), int64(2), object(2)
memory usage: 648.0+ bytes

In [22]:
df['Revenue'].replace(0,np.nan,inplace=True)
df

C:\Users\ABHISHEK YADAV\AppData\Local\Temp\ipykernel_18808\728907002.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Revenue'].replace(0,np.nan,inplace=True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,0,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,7429377,6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,7435363,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614.0,0,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943.0,3878113,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,0,11901180.0,0.18

In [23]:
df['Expenses'].replace(0,np.nan,inplace=True)
df

C:\Users\ABHISHEK YADAV\AppData\Local\Temp\ipykernel_18808\973073988.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Expenses'].replace(0,np.nan,inplace=True)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465.0,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455.0,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,7429377.0,6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,7435363.0,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303.0,8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,9254614.0,NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,9451943.0,3878113.0,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,NaN,11901180.0,0.18

In [27]:
df.select_dtypes(["object"])

              Name            Industry
0          Lamtone         IT Services
1        Stripfind  Financial Services
2  Canecorporation              Health
3          UnKnown         IT Services
4          UnKnown             UnKnown
5         Techline              Health
6          Cityace             UnKnown
7   Kayelectronics             UnKnown
8          Ganzlax         IT Services

In [30]:
df[['Name','Industry']]=df[['Name','Industry']].fillna('UnKnown')
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,11757018.0,6482465.0,5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,12329371.0,916455.0,11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,10597009.0,NaN,3005820.0,NaN
3,4.0,UnKnown,IT Services,2013.0,NaN,7429377.0,6597557.0,NaN
4,5.0,UnKnown,UnKnown,NaN,NaN,7435363.0,3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,5470303.0,8427816.0,0.23
6,7.0,Cityace,UnKnown,2010.0,9254614.0,NaN,3005116.0,0.06
7,8.0,Kayelectronics,UnKnown,2009.0,9451943.0,3878113.0,5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,14001180.0,NaN,11901180.0,0.18